# Ваше завдання — написати програму, яка перемножує всі цифри, введені користувачем цілого числа,
# поки воно не стане менше або дорівнювати 9.
#
# Користувач вводить число з клавіатури.
# 999 -> 2 # Ось чому - 999 розбиваємо на цифри і перемножуємо 9 * 9 * 9 = 729, Потім 7 * 2 * 9 = 126, потім 1 * 2 * 6 = 12 і в результаті 1 * 2 = 2
# 1000 -> 0
# 423 -> 8
# 33 -> 9
# 25 -> 0
# 1 -> 1

while True:
    # Введення числа від користувача
    number = int(input("Введите целое число (или введите 0 для завершения программы): "))

    # Проверка на завершение программы
    if number == 0:
        print("Программа завершена.До свидания!")
        break

    # Повтор исчисления, пока число больше 9
    while number > 9:
        product = 1
        for digit in str(number):  # Приводим число в ряд для доступа к каждой цифре
            product *= int(digit)  # Переумножаем цифры
        number = product  # Обновляем число для следующей итерации

    # Вывод результата
    print(f"Результат: {number}")
